Управление_гостиницами_EDT/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <comment>Регистр для хранения контактной информации</comment>
  <resources>
    <name>НомерПриведенный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерСохраненный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.ВладельцыТелефонов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_гостиницами_EDT/src/CommonModules/РаботаСКонтактнойИнформациейВызовСервера/Module.bsl
Функция ПолучитьВЛадельцаКО(РеквизитКО,Значение)   Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Владелец КАК Владелец
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация." + РеквизитКО + " = &ЗначениеРеквизита";
	
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗНачение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Владелец")[0];
	КонецЕсли; 
	


КонецФункции // ПолучитьВЛадельцаКО()
Функция ПолучитьЗначенияКО(Владелец) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
		|	КонтактнаяИнформация.НомерСохраненный КАК Телефон
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	Результат = Новый Структура;
	Для каждого Колонка Из ТаблицаРезультата.Колонки Цикл
		Результат.Вставить(Колонка.Имя);	
	КонецЦикла;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСВойств(Результат,ТаблицаРезультата[0]);
	КонецЕсли;
	Возврат Результат;


КонецФункции // ПолучитьЗначенияКО()
